
[A_Metamagic_Skill H7Skill]
mName="Метамагия"
mTooltip="Уникальный навык (Академия)."
mDescriptions[2]="В начале каждого раунда герой получает %stat4 ед. метамагии. Макс. значение: %stat1.norm.\nПоказатель метамагии прибавляется к показателю магии героя. Когда метамагия достигает значения %stat1.norm, герой получает возможность применять любые выученные заклинания на уровне ученика."
mDescriptions[3]="Максимальное значение метамагии увеличивается до %stat2.norm.\nКогда метамагия достигает значения %stat2.norm, герой получает возможность применять любые выученные заклинания на уровне знатока."
mDescriptions[4]="Максимальное значение метамагии увеличивается до %stat3.norm.\nКогда метамагия достигает значения %stat3.norm, герой получает возможность применять любые выученные заклинания на уровне мастера."
mDescriptions[0]="Метамагия заряжается в течение боя и усиливает заклинания героя."
[A_ArcaneAmplification_Ability H7HeroAbility]
mName="Концентрация магии"
mTooltip="Магический урон, наносимый вражеским существам, увеличивается на 1% от базового значения за каждую единицу метамагии."
[A_ArcaneAmplification_Buff H7BaseBuff]
mName="Концентрация магии"
mTooltip="Отряд получает на %res.norm больше урона от магии."
[A_ArcaneAttunement_Ability H7HeroAbility]
mName="Сродство с магией"
mTooltip="Метамагия увеличивает показатели %ICON_DEFENSE защиты и %ICON_INITIATIVE инициативы всех дружественных отрядов."
[A_ArcaneAttunement_Buff H7BaseBuff]
mName="Сродство с магией"
[A_ArcaneBrilliance_Ability H7HeroAbility]
mName="Талант к магии"
mTooltip="Сила воздействия метамагии на показатель магии героя удваивается."
[A_ArcaneCatalyst_Ability H7HeroAbility]
mName="Усиление метамагии"
mTooltip="Каждое использованное заклинание увеличивает показатель метамагии на %stat.norm."
[A_ArcaneChanneling_Ability H7HeroAbility]
mName="Поток магии"
mTooltip="Первая атака малой пирамиды в каждом раунде увеличивает показатель метамагии на %buff.buff.buff.buff.stat.norm."
[A_ArcaneChanneling_Buff_Hero H7BaseBuff]
mName="Поток магии"
[A_ArcaneEmpowerment_Buff H7BaseBuff]
mName="Магическая отдача"
mTooltip="Наносит %d1.min ед. урона от %ICON_PRIME изначальной магии первому вражескому отряду, который нанесет урон атакой или контратакой в ближнем бою."
[A_ArcaneShield_Ability H7HeroAbility]
mName="Магический щит"
mTooltip="В начале каждого раунда все дружественные отряды получают магический щит, который действует до конца этого раунда и поглощает количество урона, равное текущему значению метамагии, помноженному на %buff1.buff.special.val1."
[A_ArcaneShield_Buff H7BaseBuff]
mName="Магический щит"
mTooltip="Поглощает до %special.val3 ед. урона.\nДействует до конца раунда или до тех пор, пока не будет поглощено указанное количество урона."
[A_Metamagic_Buff_MagicIncrease H7BaseBuff]
mName="Метамагия"
mTooltip="Метамагия: %stat1.norm"
[A_MagicAmplification_Buff H7BaseBuff]
mTooltip="%e1"

[A_AreaSynergy_Ability H7HeroAbility]
mName="Синергия в области"
mTooltip="Теперь заклинания, поражающие существ в области, также вызывают магическую синергию."
[A_Clarity_Ability H7HeroAbility]
mName="Ясность"
mTooltip="С вероятностью 50% герой получает возможность сделать второй ход в этом раунде за каждую вызванную синергию."
[A_Clarity_Buff H7BaseBuff]
mName="Ясность"
mTooltip="Дополнительный ход героя в текущем раунде."
[A_DebilitatingShot_Ability H7HeroAbility]
mName="Изнуряющий выстрел"
mTooltip="Вражеские существа, атакованные малой пирамидой, получают %buff.buff.stat к %buff.buff.stat.icon защите на %buff.buff.durini ход(а)."
[A_DebilitatingShot_Buff H7BaseBuff]
mName="Изнуряющий выстрел"
mTooltip="%stat к %ICON_DEFENSE защите.\nДлительность (ходов): %durnow."
[A_MagicAmplification_Ability H7HeroAbility]
mName="Усиление магии"
mTooltip="%buff.buff.stat к %buff.buff.stat.icon магии за каждую вызванную магическую синергию (до +10 к %buff.buff.stat.icon магии). Длится до конца боя."
[A_MagicAttunement_Ability H7HeroAbility]
mName="Настройка магии"
mTooltip="Если заклинание вызывает магическую синергию, герой восстанавливает половину потраченной на него маны."
[A_MagicExaltation_Ability H7HeroAbility]
mName="Возвышение магии"
mTooltip="Если заклинание вызывает магическую синергию, то оно накладывается с  параметром %buff1.buff.buff.buff.stat.icon магии равным %buff1.buff.buff.buff.stat."
[A_MagicSynergy_Ability H7HeroAbility]
mName="Магическая синергия"
[A_SoulVanishingStrike_Ability H7HeroAbility]
mName="Удар душегуба"
mTooltip="Атака героя дополнительно снижает характеристики выбранного отряда на %buff.buff.stat1.norm на %buff.buff.durini ход(а).\nВлияет на урон, атаку, защиту, удачу, боевой дух, инициативу, здоровье и скорость."
[A_SoulVanishingStrike_Buff H7BaseBuff]
mName="Удар душегуба"
mTooltip="%stat4 %stat4.icon Урон, %stat1 %ICON_ATTACK Атака\n%stat2 %ICON_DEFENSE Защита, %stat6 %ICON_LUCK Удача\n%stat7 %ICON_MORALE Боевой дух, %stat3 %ICON_INITIATIVE Инициатива\n%stat9 здоровья, %stat8 %ICON_MAX_MOVEMENT Скорость\nДлительность (ходов): %durnow."

UCP 1.3

[A_ArcaneEmpowerment_Ability H7HeroAbility]
mName="Магическая отдача"
mTooltip="Когда дружественные отряды впервые атакованы в ближнем бою, противник получает %buff1.buff.d1.min ед. урона от %ICON_PRIME изначальной магии, помноженного на количество существ в атакованном отряде."